var areaParams = {
  area: [
    {
      araeName: "成都仓库",
      children: ["四川省", "重庆市"],
      center: [104.065735, 30.659462],
    },
    {
      center: [113.280637, 23.125178],
      araeName: "广州仓库",
      children: [
        "广西壮族自治区",
        "广东省",
        "海南省",
        ["福州市", "龙岩市", "莆田市", "泉州市", "三明市", "厦门市", "漳州市"], //福建
      ],
    },
    {
      center: [85.617733, 40.792818],
      araeName: "乌鲁木齐库",
      children: ["新疆维吾尔自治区"],
    },
    {
      center: [111.782279, 28.09409],
      araeName: "长沙仓库",
      children: [
        "贵州省",
        "云南省",
        "湖南省",
        "湖北省",
        ["丰城市", "抚州市", "赣州市", "高安市", "吉安市", "南昌市", "萍乡市", "新余市", "宜春市"], //江西省
      ],
    },
    {
      // 诸暨仓库
      center: [120.153576, 29.287459],
      araeName: "诸暨仓库",
      children: [
        ["杭州市", "金华市", "丽水市", "宁波市", "衢州市", "绍兴市", "台州市", "温州市", "舟山市"], //"浙江",
        ["景德镇市", "九江市", "上饶市", "鹰潭市"], //江西
        ["宁德市", "南平市"], //福建省
        ["黄山市"], //安徽省
      ],
    },
    {
      center: [108.948024, 34.263161],
      araeName: "西安仓库", // 西安仓库
      children: [
        "西藏自治区",
        "陕西省",
        "青海省",
        "宁夏回族自治区",
        "甘肃省",
        ["晋城市", "临汾市", "吕梁市", "运城市", "长治市"], //山西
        ["乌海市", "阿拉善盟"], //内蒙古自治区
        ["济源市", "焦作市", "洛阳市", "南阳市", "三门峡市"], //河南省
      ],
    },

    {
      // 江苏仓库
      center: [119.767413, 33.041544],
      araeName: "江苏仓库",
      children: [
        ["安庆市", "蚌埠市", "亳州市", "巢湖市", "合肥市", "池州市", "滁州市", "阜阳市", "淮北市", "淮南市", "六安市", "马鞍山市", "铜陵市", "芜湖市", "宿州市", "宣城市"],
        ["安阳市", "鹤壁市", "开封市", "漯河市", "平顶山市", "濮阳市", "商丘市", "新乡市", "信阳市", "许昌市", "郑州市", "周口市", "驻马店市"],
        ["淮安市", "连云港市", "南京市", "泰州市", "宿迁市", "徐州市", "盐城市", "扬州市", "镇江市"],
        ["枣庄市"],
      ], // 安徽省,河南省 江苏省 山东
    },
    {
      // 廊坊仓库
      center: [114.502461, 38.045474],
      araeName: "廊坊仓库",
      children: ["北京市", ["巴彦淖尔市", "包头市", "鄂尔多斯市", "呼和浩特市", "乌兰察布市"], ["保定市", "沧州市", "邯郸市", "衡水市", "廊坊市", "石家庄市", "邢台市", "张家口市"]], //北京 内蒙古自治区 河北
    },
    {
      center: [120.750865, 30.762653],
      araeName: "娄塘仓库",
      children: [["常州市", "南通市", "苏州市", "无锡市"], "上海市", ["湖州市", "嘉兴市"]], //江苏 上海市 浙江省

      // 娄塘仓库
    },

    {
      center: [117.000923, 36.675807],
      araeName: "山东仓库",
      children: [["菏泽市", "济南市", "济宁市", "莱芜市", "临沂市", "青岛市", "青州市", "潍坊市", "日照市", "泰安市", "威海市", "烟台市", "淄博市"]], // 山东  (青州 ,无 县级市-> 潍坊市)
    },
    {
      center: [123.429096, 41.796767],
      araeName: "沈阳仓库",
      children: [
        "黑龙江省",
        ["大兴安岭地区"], //发现地图少一块
        "吉林省",
        "辽宁省",
        ["赤峰市", "呼伦贝尔市", "通辽市", "锡林郭勒盟", "兴安盟"],
      ], //内蒙古自治区
      //
    },
    {
      center: [117.190182, 39.125596],
      araeName: "天津仓库", // 天津仓库
      children: [
        "天津市",
        ["大同市", "晋中市", "朔州市", "太原市", "忻州市", "阳泉市"], //山西
        ["滨州市", "德州市", "东营市", "聊城市"], //山东省
        ["沧州市", "承德市", "秦皇岛市", "唐山市"], //河北
      ], //
    },
    {
      center: [121.509062, 25.044332],
      araeName: "台湾省",
      children: ["台湾省"],
    },
    {
      center: [114.173355, 22.320048],
      araeName: "香港特别行政区",
      children: ["香港特别行政区"],
    },
    {
      center: [113.54909, 22.198951],
      araeName: "澳门特别行政区",
      children: ["澳门特别行政区"],
    },
    /*    {
     araeName: "钓鱼岛",
     children: ["钓鱼岛"]
   } */
  ],
};
