/*
 **area是省和城市 一起.最终去除边界时 部分省的边界也被去除,所以拆分了 省和 城市
 最终 城市 合并完大区后 city.json 去除边界线,省份.json不去 去除 
 之后在合并 省和城市的大区 也就是 index7.js

 */
var areaParams = {
  province: [
    {
      areaName: "成都服务区",
      children: ["四川省", "重庆市", "西藏自治区"],
      center: [104.065735, 30.659462],
    },
    {
      center: [113.280637, 23.125178],
      areaName: "广州服务区",
      children: ["广西壮族自治区", "广东省", "海南省"],
    },
    {
      center: [85.617733, 40.792818],
      areaName: "乌鲁木齐服务区",
      children: ["新疆维吾尔自治区"],
    },
    {
      center: [111.782279, 28.09409],
      areaName: "长沙服务区",
      children: ["贵州省", "云南省", "湖南省", "湖北省"],
    },
    {
      // 浙江服务区
      center: [120.153576, 29.287459],
      areaName: "浙江服务区",
      children: [],
    },
    {
      center: [108.948024, 34.263161],
      areaName: "西安服务区", // 西安服务区
      children: ["陕西省", "青海省", "宁夏回族自治区", "甘肃省"],
    },

    {
      // 江苏服务区
      center: [119.767413, 33.041544],
      areaName: "江苏服务区",
      children: [], // 安徽省,河南省 江苏省 山东
    },
    {
      // 河北服务区
      center: [114.502461, 38.045474],
      areaName: "河北服务区",
      children: ["北京市"], //北京 内蒙古自治区 河北
    },
    {
      center: [120.750865, 30.762653],
      areaName: "上海服务区",
      children: ["上海市"], //江苏 上海市 浙江省

      // 上海服务区
    },

    {
      center: [117.000923, 36.675807],
      areaName: "山东服务区",
      children: [], // 山东  (青州 ,无 县级市-> 潍坊市)
    },
    {
      center: [123.429096, 41.796767],
      areaName: "沈阳服务区",
      children: ["黑龙江省", "吉林省", "辽宁省"], //内蒙古自治区
      //
    },
    {
      center: [117.190182, 39.125596],
      areaName: "天津服务区", // 天津服务区
      children: ["天津市"], //
    },
    {
      center: [121.509062, 25.044332],
      areaName: "台湾省",
      children: ["台湾省"],
    },
    {
      center: [114.173355, 22.320048],
      areaName: "香港特别行政区",
      children: ["香港特别行政区"],
    },
    {
      center: [113.54909, 22.198951],
      areaName: "澳门特别行政区",
      children: ["澳门特别行政区"],
    },
  ],
  city: [
    {
      center: [113.280637, 23.125178],
      areaName: "广州服务区",

      children: [
        {
          province: "福建省",
          value: ["福州市", "龙岩市", "莆田市", "泉州市", "三明市", "厦门市", "漳州市"], //福建
        },
      ],
    },

    {
      center: [111.782279, 28.09409],
      areaName: "长沙服务区",
      children: [
        {
          province: "江西省",
          value: ["丰城市", "抚州市", "赣州市", "高安市", "吉安市", "南昌市", "萍乡市", "新余市", "宜春市"], //江西省
        },
      ],
    },
    {
      // 浙江服务区
      center: [120.153576, 29.287459],
      areaName: "浙江服务区",
      children: [
        {
          province: "浙江省",
          value: ["杭州市", "金华市", "丽水市", "宁波市", "衢州市", "绍兴市", "台州市", "温州市", "舟山市"], //"浙江",
        },
        {
          province: "江西省",
          value: ["景德镇市", "九江市", "上饶市", "鹰潭市"], //江西
        },
        {
          province: "福建省",
          value: ["宁德市", "南平市"], //福建省
        },
        {
          province: "安徽省",
          value: ["黄山市"], //安徽省
        },
      ],
    },
    {
      center: [108.948024, 34.263161],
      areaName: "西安服务区", // 西安服务区
      children: [
        {
          province: "山西省",
          value: ["晋城市", "临汾市", "吕梁市", "运城市", "长治市"], //山西
        },
        {
          province: "内蒙古自治区",
          value: ["乌海市", "阿拉善盟"],
        },
        {
          province: "河南省",
          value: ["济源市", "焦作市", "洛阳市", "南阳市", "三门峡市", "驻马店市"], //河南省
        },
      ],
    },

    {
      // 江苏服务区
      center: [119.767413, 33.041544],
      areaName: "江苏服务区",
      children: [
        {
          province: "安徽省",
          value: ["安庆市", "蚌埠市", "亳州市", "巢湖市", "合肥市", "池州市", "滁州市", "阜阳市", "淮北市", "淮南市", "六安市", "马鞍山市", "铜陵市", "芜湖市", "宿州市", "宣城市"],
        },
        {
          province: " ",
          value: ["安阳市", "鹤壁市", "开封市", "漯河市", "平顶山市", "濮阳市", "商丘市", "新乡市", "信阳市", "许昌市", "郑州市", "周口市"],
        },

        {
          province: "江苏省",
          value: ["淮安市", "连云港市", "南京市", "泰州市", "宿迁市", "徐州市", "盐城市", "扬州市", "镇江市"],
        },
        {
          province: "山东省",
          value: ["枣庄市"],
        },
      ], // 安徽省,河南省 江苏省 山东
    },
    {
      // 河北服务区
      center: [114.502461, 38.045474],
      areaName: "河北服务区",
      children: [
        {
          province: "内蒙古自治区",
          value: ["巴彦淖尔市", "包头市", "鄂尔多斯市", "呼和浩特市", "乌兰察布市"],
        },
        {
          province: "河北省",
          value: ["保定市", "沧州市", "邯郸市", "衡水市", "河北市", "石家庄市", "邢台市", "张家口市"],
        },
      ], //北京 内蒙古自治区 河北
    },
    {
      center: [120.750865, 30.762653],
      areaName: "上海服务区",
      children: [
        {
          province: "江苏省",
          value: ["常州市", "南通市", "苏州市", "无锡市"],
        },
        {
          province: "浙江省",
          value: ["湖州市", "嘉兴市"],
        },
      ], //江苏 上海市 浙江省

      // 上海服务区
    },

    {
      center: [117.000923, 36.675807],
      areaName: "山东服务区",
      children: [
        {
          province: "山东省",
          value: ["菏泽市", "济南市", "济宁市", "莱芜市", "临沂市", "青岛市", "青州市", "潍坊市", "日照市", "泰安市", "威海市", "烟台市", "淄博市"],
        },
      ], // 山东  (青州 ,无 县级市-> 潍坊市)
    },
    {
      center: [123.429096, 41.796767],
      areaName: "沈阳服务区",
      children: [
        {
          province: "黑龙江省",
          value: ["大兴安岭地区"], //发现地图少一块
        },
        {
          province: "内蒙古自治区",
          value: ["赤峰市", "呼伦贝尔市", "通辽市", "锡林郭勒盟", "兴安盟"],
        },
      ],
    },
    {
      center: [117.190182, 39.125596],
      areaName: "天津服务区", // 天津服务区
      children: [
        {
          province: "山西省",
          value: ["大同市", "晋中市", "朔州市", "太原市", "忻州市", "阳泉市"], //山西
        },
        {
          province: "山东省",
          value: ["滨州市", "德州市", "东营市", "聊城市"], //山东省
        },
        {
          province: "河北省",
          value: ["沧州市", "承德市", "秦皇岛市", "唐山市"], //河北
        },
      ], //
    },
  ],
  excudes: ["福建省", "江西省", "浙江省", "河北省", "安徽省", "山东省", "山西省", "内蒙古自治区", "江苏省", "河南省"], //这些省份/自治区 的城市被划分在不同的大区;  excudes 的目的是为了避免有区域没有划分在 province.json 中;保证国土的完整性是每一个中华儿女的义务
};

module.exports = areaParams;
